/** 针对接入园区卡需求调整 */

/** 删除原有索引 */
DROP INDEX `ix_group_code` ON settle_config;
/** 添加市场ID、排序字段*/
ALTER TABLE settle_config ADD COLUMN market_id BIGINT COMMENT '市场ID';
ALTER TABLE settle_config ADD COLUMN sort_field INT COMMENT '排序字段';
/** 清除数据 */
TRUNCATE TABLE settle_config;

/** 市场ID 1 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(1, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(1, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(1, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(1, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(1, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(1, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(1, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(1, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(1, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(1, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(1, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 2 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(2, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(2, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(2, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(2, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(2, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(2, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(2, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(2, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(2, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(2, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(2, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 3 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(3, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(3, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(3, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(3, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(3, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(3, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(3, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(3, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(3, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(3, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(3, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 4 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(4, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(4, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(4, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(4, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(4, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(4, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(4, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(4, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(4, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(4, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(4, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 5 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(5, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(5, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(5, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(5, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(5, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(5, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(5, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(5, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(5, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(5, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(5, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 6 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(6, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(6, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(6, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(6, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(6, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(6, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(6, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(6, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(6, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(6, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(6, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 7 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(7, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(7, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(7, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(7, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(7, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(7, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(7, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(7, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(7, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(7, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(7, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 8 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(8, 101, 1, '现金', 2, '初始数据(101支付方式)', 10),
	(8, 101, 2, 'POS', 2, '初始数据(101支付方式)', 20),
	(8, 101, 3, '银行卡转账', 2, '初始数据(101支付方式)', 30),
	(8, 101, 4, '支付宝', 2, '初始数据(101支付方式)', 40),
	(8, 101, 5, '微信', 2, '初始数据(101支付方式)', 50),
	(8, 101, 6, '组合支付', 2, '初始数据(101支付方式)', 60),
	(8, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(8, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(8, 102, 1, '现金', 2, '初始数据(102退款方式)', 10),
	(8, 102, 3, '银行卡转账', 2, '初始数据(102退款方式)', 20),
	(8, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 9 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(9, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(9, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(9, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(9, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(9, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(9, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(9, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(9, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(9, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(9, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(9, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 10 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(10, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(10, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(10, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(10, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(10, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(10, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(10, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(10, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(10, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(10, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(10, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 11 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(11, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(11, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(11, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(11, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(11, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(11, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(11, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(11, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(11, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(11, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(11, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 12 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(12, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(12, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(12, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(12, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(12, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(12, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(12, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(12, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(12, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(12, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(12, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 13 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(13, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(13, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(13, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(13, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(13, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(13, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(13, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(13, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(13, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(13, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(13, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 14 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(14, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(14, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(14, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(14, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(14, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(14, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(14, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(14, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(14, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(14, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(14, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 15 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(15, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(15, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(15, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(15, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(15, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(15, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(15, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(15, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(15, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(15, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(15, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 16 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(16, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(16, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(16, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(16, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(16, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(16, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(16, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(16, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(16, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(16, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(16, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 市场ID 17 */
INSERT INTO `settle_config` (`market_id`, `group_code`, `code`, `val`, `state`, `notes`, `sort_field`) VALUES
	(17, 101, 1, '现金', 1, '初始数据(101支付方式)', 10),
	(17, 101, 2, 'POS', 1, '初始数据(101支付方式)', 20),
	(17, 101, 3, '银行卡转账', 1, '初始数据(101支付方式)', 30),
	(17, 101, 4, '支付宝', 1, '初始数据(101支付方式)', 40),
	(17, 101, 5, '微信', 1, '初始数据(101支付方式)', 50),
	(17, 101, 6, '组合支付', 1, '初始数据(101支付方式)', 60),
	(17, 101, 7, '虚拟支付', 2, '初始数据(101支付方式)', 70),
	(17, 101, 8, '园区卡', 1, '初始数据(101支付方式)', 80),
	(17, 102, 1, '现金', 1, '初始数据(102退款方式)', 10),
	(17, 102, 3, '银行卡转账', 1, '初始数据(102退款方式)', 20),
	(17, 102, 8, '园区卡', 1, '初始数据(102退款方式)', 30);

/** 重建索引 */
CREATE unique INDEX `ix_market_group_code` ON settle_config(`market_id`,`group_code`,`code`);

/** 添加园区卡相关字段 */
ALTER TABLE settle_order ADD COLUMN trade_fund_account_id BIGINT COMMENT '交易资金账户ID';
ALTER TABLE settle_order ADD COLUMN trade_account_id BIGINT COMMENT '交易卡账户ID';
ALTER TABLE settle_order ADD COLUMN trade_customer_id BIGINT COMMENT '交易卡客户ID';
ALTER TABLE settle_order ADD COLUMN trade_customer_name VARCHAR(40) COMMENT '交易卡客户姓名';
ALTER TABLE settle_order ADD COLUMN trade_card_no VARCHAR(20) COMMENT '交易卡号';
ALTER TABLE settle_order ADD COLUMN trade_no VARCHAR(40) COMMENT '交易流水号';